Jackhenry/xmlTemplates/create_loan.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <SOAP-ENV:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:UsernameToken xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
                <wsse:Username>{{XUserName}}</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">{{XPassword}}</wsse:Password>
                <wsu:Created xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">{{current_timestamp}}</wsu:Created>
            </wsse:UsernameToken>
        </wsse:Security>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <AcctAdd xmlns="http://jackhenry.com/jxchange/TPG/2008">
            <MsgRqHdr>
                <jXchangeHdr>
                    <JxVer />
                    <AuditUsrId>{{XAuditUser}}</AuditUsrId>
                    <AuditWsId>{{XAuditWorkStation}}</AuditWsId>
                    <AuthenUsrId />
                    <ConsumerName />
                    <ConsumerProd />
                    <Ver_1 />
                    <jXLogTrackingId>{{guid}}</jXLogTrackingId>
                    <Ver_2 />
                    <InstRtId>{{XInstitutionRoutingID}}</InstRtId>
                    <InstEnv>{{XEnvironment}}</InstEnv>
                    <Ver_3 />
                    <BusCorrelId>{{guid}}</BusCorrelId>
                    <Ver_4 />
                    <WorkflowCorrelId />
                    <Ver_5 />
                    <ValidConsmName>{{XValidConsumerName}}</ValidConsmName>
                    <ValidConsmProd>{{XValidConsumerProduct}}</ValidConsmProd>
                    <Ver_6 />
                </jXchangeHdr>
                <Ver_1 />
                <Ver_2 />
                <Ver_3 />
            </MsgRqHdr>

            <ErrOvrRdInfoArray>
                <ErrOvrRd>
                    <ErrCode />
                    <Ver_1 />
                    <BusSvcType />
                    <Ver_2 />
                </ErrOvrRd>
                <ErrOvrRd>
                    <ErrCode />
                    <Ver_1 />
                    <BusSvcType />
                    <Ver_2 />
                </ErrOvrRd>
            </ErrOvrRdInfoArray>

            <AccountId>
                <AcctId>{{AccountId.AcctId}}</AcctId>
                <AcctType>{{AccountId.AcctType}}</AcctType>
            </AccountId>

            <LnAdd>
                <LnInfoRec>
                    <Term>
                        <TermCnt>{{LnAdd.LnInfoRec.Term.TermCnt}}</TermCnt>
                        <TermUnits>{{LnAdd.LnInfoRec.Term.TermUnits}}</TermUnits>
                    </Term>
                    <RemPmtCnt>{{LnAdd.LnInfoRec.RemPmtCnt}}</RemPmtCnt>
                    <PmtTermUnits>{{LnAdd.LnInfoRec.PmtTermUnits}}</PmtTermUnits>
                    <PmtTerm>{{LnAdd.LnInfoRec.PmtTerm}}</PmtTerm>
                    <PmtCode>{{LnAdd.LnInfoRec.PmtCode}}</PmtCode>
                    <PmtAmt>{{LnAdd.LnInfoRec.PmtAmt}}</PmtAmt>
                    <PIAmt>{{LnAdd.LnInfoRec.PIAmt}}</PIAmt>
                    <OrigBal>{{LnAdd.LnInfoRec.OrigBal}}</OrigBal>
                    <OpenDt>{{LnAdd.LnInfoRec.OpenDt}}</OpenDt>
                    <OffCode>{{LnAdd.LnInfoRec.OffCode}}</OffCode>
                    <MatDt>{{LnAdd.LnInfoRec.MatDt}}</MatDt>
                    <IntRate>{{LnAdd.LnInfoRec.IntRate}}</IntRate>
                    <BrCode>{{LnAdd.LnInfoRec.BrCode}}</BrCode>
                    <ProdCode>{{LnAdd.LnInfoRec.ProdCode}}</ProdCode>
                    <AcctStat>{{LnAdd.LnInfoRec.AcctStat}}</AcctStat>
                    <CustId>{{LnAdd.LnInfoRec.CustId}}</CustId>
                    <OddDaysIntBasis>{{LnAdd.LnInfoRec.OddDaysIntBasis}}</OddDaysIntBasis>
                </LnInfoRec>

                <LnAcctInfo>
                    <SubPrimeLnCode>{{LnAdd.LnAcctInfo.SubPrimeLnCode}}</SubPrimeLnCode>
                    <State>{{LnAdd.LnAcctInfo.State}}</State>
                    <PurpCode>{{LnAdd.LnAcctInfo.PurpCode}}</PurpCode>
                    <PrtPastDueNotCode>{{LnAdd.LnAcctInfo.PrtPastDueNotCode}}</PrtPastDueNotCode>
                    <OrigLnToValRatio>{{LnAdd.LnAcctInfo.OrigLnToValRatio}}</OrigLnToValRatio>
                    <LateChgCode>{{LnAdd.LnAcctInfo.LateChgCode}}</LateChgCode>
                    <DeptCode>{{LnAdd.LnAcctInfo.DeptCode}}</DeptCode>
                    <CurLnToValRatio>{{LnAdd.LnAcctInfo.CurLnToValRatio}}</CurLnToValRatio>
                    <CrRatingCode>{{LnAdd.LnAcctInfo.CrRatingCode}}</CrRatingCode>
                    <CollatCode>{{LnAdd.LnAcctInfo.CollatCode}}</CollatCode>
                    <AnnIncmAmt>{{LnAdd.LnAcctInfo.AnnIncmAmt}}</AnnIncmAmt>
                    <AcctClsfCode>{{LnAdd.LnAcctInfo.AcctClsfCode}}</AcctClsfCode>
                    <CombLTV>{{LnAdd.LnAcctInfo.CombLTV}}</CombLTV>
                    <CrScoreId>{{LnAdd.LnAcctInfo.CrScoreId}}</CrScoreId>
                    <MoIncmAmt>{{LnAdd.LnAcctInfo.MoIncmAmt}}</MoIncmAmt>
                    <NumBorw>{{LnAdd.LnAcctInfo.NumBorw}}</NumBorw>
                    <TotDebtPct>{{LnAdd.LnAcctInfo.TotDebtPct}}</TotDebtPct>
                    <CrBureauRptCode>{{LnAdd.LnAcctInfo.CrBureauRptCode}}</CrBureauRptCode>
                    <PrtCouponBook>{{LnAdd.LnAcctInfo.PrtCouponBook}}</PrtCouponBook>
                </LnAcctInfo>

                <LnBalDtInfo>
                    <FirstPmtDt>{{LnAdd.LnBalDtInfo.FirstPmtDt}}</FirstPmtDt>
                </LnBalDtInfo>

                <LnPmtInfo>
                    <UsePmtSusp>{{LnAdd.LnPmtInfo.UsePmtSusp}}</UsePmtSusp>
                    <BilLeadDays>{{LnAdd.LnPmtInfo.BilLeadDays}}</BilLeadDays>
                </LnPmtInfo>

                <LnRateInfo>
                    <RateVarCode>{{LnAdd.LnRateInfo.RateVarCode}}</RateVarCode>
                    <RateVar>{{LnAdd.LnRateInfo.RateVar}}</RateVar>
                    <RateFlr>{{LnAdd.LnRateInfo.RateFlr}}</RateFlr>
                    <RateCeil>{{LnAdd.LnRateInfo.RateCeil}}</RateCeil>
                    <OrigIdxVal>{{LnAdd.LnRateInfo.OrigIdxVal}}</OrigIdxVal>
                </LnRateInfo>

                <LnRealEstateInfo>
                    <PropStreet>{{LnAdd.LnRealEstateInfo.PropStreet}}</PropStreet>
                    <PropState>{{LnAdd.LnRealEstateInfo.PropState}}</PropState>
                    <PropPostalCode>{{LnAdd.LnRealEstateInfo.PropPostalCode}}</PropPostalCode>
                    <PropCity>{{LnAdd.LnRealEstateInfo.PropCity}}</PropCity>
                    <FloodInsurCode>{{LnAdd.LnRealEstateInfo.FloodInsurCode}}</FloodInsurCode>
                    <ApprVal>{{LnAdd.LnRealEstateInfo.ApprVal}}</ApprVal>
                    <ApprDt>{{LnAdd.LnRealEstateInfo.ApprDt}}</ApprDt>
                    <OccupCode>{{LnAdd.LnRealEstateInfo.OccupCode}}</OccupCode>
                    <PropCounty>{{LnAdd.LnRealEstateInfo.PropCounty}}</PropCounty>
                </LnRealEstateInfo>

                <LnRegRptInfo>
                    <NAICSCode>{{LnAdd.LnRegRptInfo.NAICSCode}}</NAICSCode>
                    <CallRptCode>{{LnAdd.LnRegRptInfo.CallRptCode}}</CallRptCode>
                    <Req1098>{{LnAdd.LnRegRptInfo.Req1098}}</Req1098>
                    <SBAGuarPct>{{LnAdd.LnRegRptInfo.SBAGuarPct}}</SBAGuarPct>
                    <SBAGuarId>{{LnAdd.LnRegRptInfo.SBAGuarId}}</SBAGuarId>
                    <SBABasisPts>{{LnAdd.LnRegRptInfo.SBABasisPts}}</SBABasisPts>
                    <GLCostCtr>{{LnAdd.LnRegRptInfo.GLCostCtr}}</GLCostCtr>
                </LnRegRptInfo>
            </LnAdd>
        </AcctAdd>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>